let arr = [76, 23, 80, 87, 8, 82, 11, 78, 28, 92, 30, 66, 42, 26,
    64, 84, 75, 27, 51, 10, 38, 39, 62, 74, 57, 13, 20, 71, 22, 33, 17, 
    48, 50, 61, 16, 29, 83, 44, 35, 15, 41, 63, 69, 34, 40, 49, 95, 4,
    14, 1, 97, 60, 86, 85, 6, 77, 55, 2, 31, 46, 59, 3, 19, 65, 90, 91,
    88, 37, 93, 25, 43, 53, 70, 94, 81, 54, 89, 52, 12, 21, 24, 18, 7, 
    56, 100, 73, 9, 68, 96, 72, 32, 36, 79, 67, 47, 45, 99, 58, 98 ];

const reducer = (accumulator, currentValue) => accumulator + currentValue;

// 1 + 2 + 3 + 4
console.log('Исходные данные:',arr);
console.log('Результат сложения исходных данных:',arr.reduce(reducer));
console.log('Вычтем полученный результат из суммы всех чисел от 1 до 100 и получим пропущенное число:', '5050 -',arr.reduce(reducer),'=', 5050 - arr.reduce(reducer));

