let arr = [75, 9, 23, 61, 66, 35, 88, 80, 48, 58, 31, 13, 34, 55, 42, 14, 72,
    38, 63, 5, 93, 32, 17, 12, 26, 98, 45, 6, 60, 25, 67, 59, 7, 
    69, 36, 100, 46, 40, 37, 87, 8, 84, 97, 16, 76, 43, 62, 50, 
    11, 49, 78, 99, 33, 10, 52, 94, 41, 85, 3, 92, 89, 51, 4, 18, 28,
    2, 82, 71, 24, 39, 81, 19, 14, 54, 65, 79, 30, 21, 77, 57, 53, 68,
    90, 29, 70, 73, 74, 64, 83, 27, 95, 86, 91, 44, 96, 22, 56, 20, 15, 1, 47];

const reducer = (accumulator, currentValue) => accumulator + currentValue;

// 1 + 2 + 3 + 4
console.log('Исходные данные:',arr);
console.log('Результат сложения исходных данных:',arr.reduce(reducer));
console.log('Вычтем из полученного результата сумму всех чисел от 1 до 100 и получим повторяемое число:',arr.reduce(reducer),'- 5050','=', arr.reduce(reducer) - 5050);